Revit 2027 API
Options.DetailLevel Property
The detail level for the geometry extracted with these options.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ViewDetailLevel DetailLevel { get; set; }
Public Property DetailLevel As ViewDetailLevel
	Get
	Set
public:
property ViewDetailLevel DetailLevel {
	ViewDetailLevel get ();
	void set (ViewDetailLevel value);
}
member DetailLevel : ViewDetailLevel with get, set
Property Value
ViewDetailLevel
Exceptions
Exception | Condition
InvalidOperationException | Thrown when setting this property, if View is already set. When View is set the detail level of the view is used.
See Also
Reference
Options Class
Autodesk.Revit.DB Namespace